## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                               NAME                                                |
|----------|---------------------------------------------------------------------------------------------------|
| delete   | `module.system_status_static_site.aws_s3_bucket.this`                                             |
|          | `module.system_status_static_site.random_string.suffix`                                           |
| recreate | `aws_acm_certificate_validation.system_status_static_site[0]`                                     |
| add      | `aws_route53_record.system_status_static_site[0]`                                                 |
|          | `module.system_status_static_site[0].aws_cloudfront_distribution.simple_static_website`           |
|          | `module.system_status_static_site[0].aws_cloudfront_origin_access_identity.simple_static_website` |
|          | `module.system_status_static_site[0].aws_route53_record.cloudfront_alias`                         |
|          | `module.system_status_static_site[0].aws_s3_bucket.this`                                          |
|          | `module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy`                             |
|          | `module.system_status_static_site[0].aws_s3_bucket_website_configuration.this`                    |
|          | `module.system_status_static_site[0].random_string.suffix`                                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate_validation.system_status_static_site[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "system_status_static_site" {
      ~ id                      = "2024-01-09 18:47:57.125 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.system_status_static_site[0] will be created
  + resource "aws_route53_record" "system_status_static_site" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_s3_bucket.this will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> null
      - bucket                      = "notification-canada-ca-staging-system-status" -> null
      - bucket_domain_name          = "notification-canada-ca-staging-system-status.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "notification-canada-ca-staging-system-status" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint            = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.system_status_static_site.random_string.suffix will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "vbcwf3ri" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "vbcwf3ri" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.system_status_static_site[0].data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site[0].aws_cloudfront_distribution.simple_static_website will be created
  + resource "aws_cloudfront_distribution" "simple_static_website" {
      + aliases                         = [
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "simple_static_website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "simple_static_website"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:239043911459:certificate/c3e1b153-4a3e-4aa9-a19d-8c67f331ee71"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.system_status_static_site[0].aws_cloudfront_origin_access_identity.simple_static_website will be created
  + resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.system_status_static_site[0].aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "status.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.system_status_static_site[0].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-staging-system-status"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy will be created
  + resource "aws_s3_bucket_policy" "oai_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.system_status_static_site[0].aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.system_status_static_site[0].random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 9 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ system_status_static_site_bucket_id     = "" -> (known after apply)
  ~ system_status_static_site_bucket_name   = "" -> (known after apply)
  ~ system_status_static_site_bucket_region = "" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

